app/Controllers/Home.php

INSERT INTO `traffic` (`traffic_agent`, `traffic_hal`) VALUES ('Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/131.0.0.0 Safari/537.36', 1)
---
    public function __construct()
    {
        $this->packagesModel = new PackagesModel();
        $this->githubModel = new GithubModel();
        $this->suggestionModel = new SuggestionModel();
        $this->rateModel = new RateModel();
        $this->ordersModel = new OrdersModel();

        $trafficModel = new TrafficModel();

        $agent = $_SERVER['HTTP_USER_AGENT'];
        $trafficModel->insert([
            'traffic_agent' => $agent,
            'traffic_hal' => 1
        ]);

SELECT *
FROM `packages`
---
    public function index(): string
    {
        $session = session();
        if (!$session->has('notif')) {
            $session->set('notif', true);
            $session->markAsTempdata('notif', 1800);
        } elseif ($session->get('notif') === true) {
            $session->set('notif', false);
        }
        if (!$session->has('rate')) {
            $session->set('rate', true);
            $session->markAsTempdata('rate', 1800);
        }

        $status = [
            'page' => 'home',
            'judul' => 'Home'
        ];

        $packages = $this->packagesModel->findAll();