app/Controllers/Home.php

    public function index(): string
    {
        $status = [
            'page' => 'home',
            'judul' => 'Home'
        ];

        $packages = $this->packagesModel->findAll();
---
SELECT *
FROM `packages`

    public function package_detail($slug): string
    {
        $status = [
            'page' => 'package',
            'judul' => 'Package'
        ];

        $name = ucfirst($slug);
        $package = $this->packagesModel->where('packets_name', $name)->first();
---
SELECT *
FROM `packages`
WHERE `packets_name` = 'Corporate'
 LIMIT 1