app/Controllers/Transaction.php

    public function __construct()
    {
        $this->packagesModel = new PackagesModel();
        $this->ordersModel = new OrdersModel();
        $this->transactionModel = new TransactionModel();

        $trafficModel = new TrafficModel();

        $agent = $_SERVER['HTTP_USER_AGENT'];
        $trafficModel->insert([
            'traffic_agent' => $agent,
            'traffic_hal' => 2
        ]);
---
INSERT INTO `traffic` (`traffic_agent`, `traffic_hal`) VALUES ('Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/131.0.0.0 Safari/537.36', 2)

    public function detail($transaction_id): string
    {
        $status = [
            'page' => 'transaction',
            'judul' => 'Transaction'
        ];

        $packages = $this->packagesModel->findAll();
        $tr = $this->transactionModel->find($transaction_id);
---
SELECT *
FROM `packages`
SELECT *
FROM `transaction`
WHERE `transaction`.`transaction_id` = '5647634702'

    public function download($transactionId)
    {
        $transactionModel = new \App\Models\TransactionModel();
        $tr = $transactionModel->find($transactionId);
---
SELECT *
FROM `transaction`
WHERE `transaction`.`transaction_id` = '5647634702'