app/Models/TrafficModel.php

    public function getTrafficLast30Days()
    {
        $builder = $this->builder();
        $builder->select('DATE(created_at) as date, COUNT(*) as total_visits')
                ->groupBy('DATE(created_at)')
                ->orderBy('DATE(created_at)', 'DESC')
                ->where('created_at >=', date('Y-m-d', strtotime('-30 days')));
        $query = $builder->get();
---
SELECT DATE(created_at) as date, COUNT(*) as total_visits
FROM `traffic`
WHERE `created_at` >= '2024-12-28'
GROUP BY DATE(created_at)
ORDER BY DATE(created_at) DESC